DiplomArs4/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисленияИУдержания</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Удержание</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУдержания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomArs4/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

DiplomArs4/src/Documents/ВКМ_НачислениеЗаработнойПлаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеНачисленияИУдержания

&НаКлиенте
Процедура ОсновныеНачисленияИУдержанияНачислениеПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ОсновныеНачисленияИУдержания.ТекущиеДанные;
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ИзмененнаяСтрока.Начисление = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад") Тогда 
		
		ИзмененнаяСтрока.СуммаНачисления = ВКМ_ЗаполнениеНачислениеЗарплатыВызовСервера.ЗаполнениеОкладаСотрудника(Объект.Дата, ИзмененнаяСтрока.Сотрудник);
	ИначеЕсли
		
		ИзмененнаяСтрока.Начисление = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск") Тогда
		ИзмененнаяСтрока.СуммаНачисления = 0;
		
		ПересчитатьНДФЛ(ИзмененнаяСтрока);
		
	КонецЕсли;
	
	ПересчитатьНДФЛ(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияИУдержанияУдержаниеПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ОсновныеНачисленияИУдержания.ТекущиеДанные;
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ПересчитатьНДФЛ(ИзмененнаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьНДФЛ()
	
	Возврат Константы.ВКМ_НДФЛ.Получить();
	
КонецФункции 

&НаКлиенте
Процедура ПересчитатьНДФЛ(ИзмененнаяСтрока)
	
	Если ИзмененнаяСтрока.Удержание = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_Удержания.НДФЛ") Тогда
		
		НДФЛ = ПолучитьНДФЛ();
		
		ИзмененнаяСтрока.СуммаУдержания = ИзмененнаяСтрока.СуммаНачисления / 100 * НДФЛ;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
